wolfSSL/wolfssl-examples/ESP32/TLS13-ENC28J60-server/main/enc28j60_example_main.c
/* ENC28J60 Example

   This example code is in the Public Domain (or CC0 licensed, at your option.)

   Unless required by applicable law or agreed to in writing, this
   software is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR
   CONDITIONS OF ANY KIND, either express or implied.
*/

/*
 *
 *  see https://www.wolfssl.com/docs/quickstart/
 **/

#define WOLFSSL_ESPIDF
#define WOLFSSL_ESPWROOM32
#define WOLFSSL_USER_SETTINGS

/* the usual suspects */
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <errno.h>

#include "sdkconfig.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_netif.h"
#include "esp_eth.h"
#include "esp_event.h"
#include "esp_log.h"
#include "driver/gpio.h"
#include "enc28j60.h"
#include "driver/spi_master.h"

#include "nvs_flash.h"
#if ESP_IDF_VERSION_MAJOR >= 4
// #include "protocol_examples_common.h"
#endif

/* socket includes */
#include "lwip/netdb.h"
#include "lwip/sockets.h"

/* time */
#include  <lwip/apps/sntp.h>

/* wolfSSL */
#include <wolfssl/wolfcrypt/settings.h> // make sure this appears before any other wolfSSL headers
#include <wolfssl/ssl.h>

#ifdef WOLFSSL_TRACK_MEMORY
#include <wolfssl/wolfcrypt/mem_track.h>
#endif

/**
 ******************************************************************************
 ******************************************************************************
 ** USER APPLICATION SETTINGS BEGIN
 ******************************************************************************
 ******************************************************************************
 **/

/* ENC28J60 doesn't burn any factory MAC address, we need to set it manually.
   02:00:00 is a Locally Administered OUI range so should not be used except when testing on a LAN under your control.
*/
uint8_t myMacAddress[] = {
    0x02,
    0x00,
    0x00,
    0x12,
    0x34,
    0x56
};

/* ESP lwip */
#define EXAMPLE_ESP_MAXIMUM_RETRY  CONFIG_ESP_MAXIMUM_RETRY

#define DEFAULT_PORT                     11111

#define TLS_SMP_CLIENT_TASK_NAME         "tls_server_example"
#define TLS_SMP_CLIENT_TASK_WORDS        10240
#define TLS_SMP_CLIENT_TASK_PRIORITY     8



/* include certificates. Note that there is an experiation date! 
 * 
 * See also https://github.com/wolfSSL/wolfssl/blob/master/wolfssl/certs_test.h
 
   for example:
     
    #define USE_CERT_BUFFERS_2048
    #include <wolfssl/certs_test.h>
*/

/* 
* for reference, embedded client uses:
* 
* #include "embedded_CA_FILE.h"
* #include "embedded_CERT_FILE.h"
* #include "embedded_KEY_FILE.h"
*/

/*
server file system versions:
#define CA_FILE   "../../../../certs/client-cert.pem"
#define CERT_FILE "../../../../certs/server-cert.pem"
#define KEY_FILE  "../../../../certs/server-key.pem"
*/

#include "embedded_CLIENT_CERT_FILE.h"
#include "embedded_SERVER_CERT_FILE.h"
#include "embedded_SERVER_KEY_FILE.h"


static const char *TAG = "eth_example";

// see https://tf.nist.gov/tf-cgi/servers.cgi
const int NTP_SERVER_COUNT = 3;
const char* ntpServerList[] = {
    "pool.ntp.org",
    "time.nist.gov",
    "utcnist.colorado.edu"
};
const char * TIME_ZONE = "PST-8";
const long  gmtOffset_sec = 3600;
const int   daylightOffset_sec = 3600;

TickType_t DelayTicks = 5000 / portTICK_PERIOD_MS;
/**
 ******************************************************************************
 ******************************************************************************
 ** USER SETTINGS END
 ******************************************************************************
 ******************************************************************************
 **/
  


#ifdef HAVE_SIGNAL
static void sig_handler(const int sig) {
//    fprintf(stderr, "SIGINT handled = %d.\n", sig);

    mShutdown = 1;
    if (mConnd != SOCKET_INVALID) {
        close(mConnd); /* Close the connection to the client   */
        mConnd = SOCKET_INVALID;
    }
    if (mSockfd != SOCKET_INVALID) {
        close(mSockfd); /* Close the socket listening for clients   */
        mSockfd = SOCKET_INVALID;
    }
}
#endif

int tls_smp_server_task() {
    int ret = WOLFSSL_SUCCESS; /* assume success until proven wrong */
    int sockfd = 0; /* the socket that will carry our secure connection */
    struct sockaddr_in servAddr;
    const int BUFF_SIZE = 256;
    char buff[BUFF_SIZE];
    size_t len; /* we'll be looking at the length of messages sent and received */

    struct sockaddr_in clientAddr;
    socklen_t          size = sizeof(clientAddr);
    const char*        reply = "I hear ya fa shizzle!\n";
    int                on;

    static int mConnd = SOCKET_INVALID;
    static int mShutdown = 0;

    /* declare wolfSSL objects */
    WOLFSSL_CTX *ctx = NULL; /* the wolfSSL context object*/
    WOLFSSL *ssl = NULL; /* although called "ssl" is is the secure object for reading and writings data*/

#ifdef HAVE_SIGNAL
    signal(SIGINT, sig_handler);
#endif

#ifdef DEBUG_WOLFSSL
    wolfSSL_Debugging_ON();
    WOLFSSL_MSG("Debug ON v0.2b");
    //ShowCiphers();
#endif /* DEBUG_WOLFSSL */

#ifndef WOLFSSL_TLS13
    ret = WOLFSSL_FAILURE;
    WOLFSSL_ERROR_MSG("ERROR: Example requires TLS v1.3.\n");
#endif /* WOLFSSL_TLS13 */
    
    /* Initialize the server address struct with zeros */
    memset(&servAddr, 0, sizeof(servAddr));

    /* Fill in the server address */
    servAddr.sin_family      = AF_INET; /* using IPv4      */
    servAddr.sin_port        = htons(DEFAULT_PORT); /* on DEFAULT_PORT */
    servAddr.sin_addr.s_addr = INADDR_ANY; /* from anywhere   */

    /* 
    ***************************************************************************
    * Create a socket that uses an internet IPv4 address,
    * Sets the socket to be stream based (TCP),
    * 0 means choose the default protocol.
    * 
    *  #include <sys/socket.h>
    *
    *  int socket(int domain, int type, int protocol);  
    *  
    *  The socket() function shall create an unbound socket in a communications 
    *  domain, and return a file descriptor that can be used in later function 
    *  calls that operate on sockets.
    *  
    *  The socket() function takes the following arguments:
    *    domain     Specifies the communications domain in which a 
    *                 socket is to be created.
    *    type       Specifies the type of socket to be created.
    *    protocol   Specifies a particular protocol to be used with the socket. 
    *               Specifying a protocol of 0 causes socket() to use an 
    *               unspecified default protocol appropriate for the 
    *               requested socket type.
    *               
    *    The domain argument specifies the address family used in the 
    *    communications domain. The address families supported by the system 
    *    are implementation-defined.
    *    
    *    Symbolic constants that can be used for the domain argument are
    *    defined in the <sys/socket.h> header.
    *
    *  The type argument specifies the socket type, which determines the semantics 
    *  of communication over the socket. The following socket types are defined; 
    *  implementations may specify additional socket types:
    *
    *    SOCK_STREAM    Provides sequenced, reliable, bidirectional, 
    *                   connection-mode byte streams, and may provide a 
    *                   transmission mechanism for out-of-band data.
    *    SOCK_DGRAM     Provides datagrams, which are connectionless-mode,
    *                   unreliable messages of fixed maximum length.
    *    SOCK_SEQPACKET Provides sequenced, reliable, bidirectional, 
    *                   connection-mode transmission paths for records. 
    *                   A record can be sent using one or more output 
    *                   operations and received using one or more input 
    *                   operations, but a single operation never transfers 
    *                   part of more than one record. Record boundaries 
    *                   are visible to the receiver via the MSG_EOR flag.
    *    
    *                   If the protocol argument is non-zero, it shall 
    *                   specify a protocol that is supported by the address 
    *                   family. If the protocol argument is zero, the default
    *                   protocol for this address family and type shall be
    *                   used. The protocols supported by the system are 
    *                   implementation-defined.
    *    
    *    The process may need to have appropriate privileges to use the socket() function or to create some sockets.
    *    
    *  Return Value
    *    Upon successful completion, socket() shall return a non-negative integer, 
    *    the socket file descriptor. Otherwise, a value of -1 shall be returned 
    *    and errno set to indicate the error.
    *    
    *  Errors; The socket() function shall fail if:
    *  
    *    EAFNOSUPPORT    The implementation does not support the specified address family.
    *    EMFILE          No more file descriptors are available for this process.
    *    ENFILE          No more file descriptors are available for the system.
    *    EPROTONOSUPPORT The protocol is not supported by the address family, or the protocol is not supported by the implementation.
    *    EPROTOTYPE      The socket type is not supported by the protocol.
    *    
    *  The socket() function may fail if:
    *  
    *    EACCES  The process does not have appropriate privileges.
    *    ENOBUFS Insufficient resources were available in the system to perform the operation.
    *    ENOMEM  Insufficient memory was available to fulfill the request.
    *    
    *  see: https://linux.die.net/man/3/socket
    ***************************************************************************
    */
    if (ret == WOLFSSL_SUCCESS) {
        /* Upon successful completion, socket() shall return 
         * a non-negative integer, the socket file descriptor.
        */
        sockfd = socket(AF_INET, SOCK_STREAM, 0);
        if (sockfd > 0) {
            WOLFSSL_MSG("socket creation successful\n");
        }
        else {
            // TODO show errno 
            ret = WOLFSSL_FAILURE;
            WOLFSSL_ERROR_MSG("ERROR: failed to create a socket.\n");
        }
    }
    else {
        WOLFSSL_ERROR_MSG("Skipping socket create.\n");
    }


