wolfSSL/wolfssl-examples/ESP32/TLS13-ENC28J60-server/main/enc28j60_example_main.c
    /* 
    ***************************************************************************
    *  Load CA certificate into WOLFSSL_CTX 
    * 
    *  wolfSSL_CTX_load_verify_buffer()
    *  WOLFSSL_API int wolfSSL_CTX_load_verify_buffer(WOLFSSL_CTX *,
    *                                                 const unsigned char *,
    *                                                 long,
    *                                                 int      
    *                                                )        
    *                                                
    *  This function loads a CA certificate buffer into the WOLFSSL Context. 
    *  It behaves like the non-buffered version, only differing in its ability 
    *  to be called with a buffer as input instead of a file. The buffer is 
    *  provided by the in argument of size sz. format specifies the format type 
    *  of the buffer; SSL_FILETYPE_ASN1 or SSL_FILETYPE_PEM. More than one 
    *  CA certificate may be loaded per buffer as long as the format is in PEM.
    *  
    *  Please see the examples for proper usage.
    *  
    *  Returns
    *  
    *    SSL_SUCCESS upon success
    *    SSL_BAD_FILETYPE will be returned if the file is the wrong format.
    *    SSL_BAD_FILE will be returned if the file doesn’t exist, can’t be read, or is corrupted.
    *    MEMORY_E will be returned if an out of memory condition occurs.
    *    ASN_INPUT_E will be returned if Base16 decoding fails on the file.
    *    BUFFER_E will be returned if a chain buffer is bigger than the receiving buffer.
    *    
    *  Parameters
    *  
    *    ctx    pointer to the SSL context, created with wolfSSL_CTX_new().
    *    in    pointer to the CA certificate buffer.
    *    sz    size of the input CA certificate buffer, in.
    *    format    format of the buffer certificate, either SSL_FILETYPE_ASN1 or SSL_FILETYPE_PEM.
    *
    * see https://www.wolfssl.com/doxygen/group__CertsKeys.html#gaa37539cce3388c628ac4672cf5606785
    ***************************************************************************
    */
    if (ret == WOLFSSL_SUCCESS) {
        ret = wolfSSL_CTX_load_verify_buffer(ctx, CA_FILE, sizeof_CA_FILE(), WOLFSSL_FILETYPE_PEM);
        if (ret == WOLFSSL_SUCCESS) {
            WOLFSSL_MSG("wolfSSL_CTX_load_verify_buffer successful\n");
        }
        else {
            WOLFSSL_ERROR_MSG("ERROR: wolfSSL_CTX_load_verify_buffer failed\n");
        }
    }
    else {
        WOLFSSL_ERROR_MSG("skipping wolfSSL_CTX_load_verify_buffer\n");
    }
 
    /* Require mutual authentication */
    wolfSSL_CTX_set_verify(ctx,
        WOLFSSL_VERIFY_PEER | WOLFSSL_VERIFY_FAIL_IF_NO_PEER_CERT,
        NULL);

    

    
    /* Continue to accept clients until mShutdown is issued */
    while (!mShutdown && (ret == WOLFSSL_SUCCESS)) {
        WOLFSSL_MSG("Waiting for a connection...\n");
        
        /* Accept client connections */
        if ((mConnd = accept(sockfd, (struct sockaddr*)&clientAddr, &size))
            == -1) {
            // fprintf(stderr, "ERROR: failed to accept the connection\n\n");
            ret = -1; 
            // TODO    goto exit;
                WOLFSSL_ERROR_MSG("ERROR: failed socket accept\n");
                ret = WOLFSSL_FAILURE;
        }

        /* Create a WOLFSSL object */
        if ((ssl = wolfSSL_new(ctx)) == NULL) {
            // fprintf(stderr, "ERROR: failed to create WOLFSSL object\n");
            ret = -1; 
            //TODO goto exit;
            WOLFSSL_ERROR_MSG("ERROR: filed wolfSSL_new during loop\n");
            ret = WOLFSSL_FAILURE;
    }

        /* Attach wolfSSL to the socket */
        wolfSSL_set_fd(ssl, mConnd);

#ifdef HAVE_SECRET_CALLBACK
        /* required for getting random used */
        wolfSSL_KeepArrays(ssl);

        /* optional logging for wireshark */
        wolfSSL_set_tls13_secret_cb(ssl,
            Tls13SecretCallback,
            (void*)WOLFSSL_SSLKEYLOGFILE_OUTPUT);
#endif

        /* Establish TLS connection */
        if ((ret = wolfSSL_accept(ssl)) != WOLFSSL_SUCCESS) {
            WOLFSSL_ERROR_MSG("ERROR: wolfSSL_accept\n");
            ret = WOLFSSL_FAILURE;
            // fprintf(stderr,
            //       "wolfSSL_accept error = %d\n",
            //    wolfSSL_get_error(ssl, ret));
            // TODO goto exit;
        }
        else {
            WOLFSSL_MSG("Client connected successfully\n");
        }


#ifdef HAVE_SECRET_CALLBACK
        wolfSSL_FreeArrays(ssl);
#endif

        /* Read the client data into our buff array */
        memset(buff, 0, sizeof(buff));
        if ((ret = wolfSSL_read(ssl, buff, sizeof(buff) - 1)) < 0) {
            // fprintf(stderr, "ERROR: failed to read\n");
            //TODO goto exit;
        }

        /* Print to stdout any data the client sends */
        // printf("Client: %s\n", buff);

        /* Check for server shutdown command */
        if (strncmp(buff, "shutdown", 8) == 0) {
            // printf("Shutdown command issued!\n");
            mShutdown = 1;
        }

        /* Write our reply into buff */
        memset(buff, 0, sizeof(buff));
        memcpy(buff, reply, strlen(reply));
        len = strnlen(buff, sizeof(buff));

        /* Reply back to the client */
        if ((ret = wolfSSL_write(ssl, buff, len)) != len) {
            // fprintf(stderr, "ERROR: failed to write\n");
            // TODO goto exit;
        }

        /* Cleanup after this connection */
        wolfSSL_shutdown(ssl);
        if (ssl) {
            wolfSSL_free(ssl); /* Free the wolfSSL object              */
            ssl = NULL;
        }
        if (mConnd != SOCKET_INVALID) {
            close(mConnd); /* Close the connection to the client   */
            mConnd = SOCKET_INVALID;
        }
    }

    WOLFSSL_MSG("Shutdown complete\n");

    /* 
    ***************************************************************************
    *    
    *    Cleanup and return 
    *    
    ***************************************************************************
    */
    if (mConnd != SOCKET_INVALID) {
        close(mConnd); /* Close the connection to the client   */
        mConnd = SOCKET_INVALID;
    }

    if (sockfd != SOCKET_INVALID) {
        close(sockfd); /* Close the socket listening for clients   */
        sockfd = SOCKET_INVALID;
    }
    
    if (ssl) {
        wolfSSL_free(ssl); /* Free the wolfSSL object */
    }

    
    if (ctx) {
        wolfSSL_CTX_free(ctx); /* Free the wolfSSL context object          */
    }
    
    wolfSSL_Cleanup(); /* Cleanup the wolfSSL environment          */

    return ret;
}


/** Event handler for Ethernet events */
static void eth_event_handler(void *arg,
    esp_event_base_t event_base,
    int32_t event_id,
    void *event_data) {
    uint8_t mac_addr[6] = { 0 };
    /* we can get the ethernet driver handle from event data */
    esp_eth_handle_t eth_handle = *(esp_eth_handle_t *)event_data;

    switch (event_id) {
    case ETHERNET_EVENT_CONNECTED:
        /*
         * see ESP-IDF 5.0 note at 
         * https://docs.espressif.com/projects/esp-idf/en/latest/esp32/migration-guides/ethernet.html
         * 
         * esp_eth_ioctl() third argument could take int (bool) number as an input in some cases.
         * However, it was not properly documented and, in addition, the number had to be “unnaturally” 
         * type casted to void * datatype to prevent compiler warnings as shown in below example:
         * 
         * esp_eth_ioctl(eth_handle, ETH_CMD_S_FLOW_CTRL, (void *)true);
         *
         * This could lead to misuse of the esp_eth_ioctl(). Therefore, ESP-IDF 5.0 unified usage of 
         * esp_eth_ioctl(). Its third argument now always acts as pointer to a memory location of specific 
         * type from/to where the configuration option is read/stored.
         * 
         * TODO Migrate Ethernet Drivers to ESP-IDF 5.0
         
